black = "\033[30m"
red = "\033[31m"
green = "\033[32m"
yellow = "\033[33m"
blue = "\033[34m"
violet = "\033[35m"
turquoise = "\033[36m"
white = "\033[37m"
st = "\033[37"

ru_loc = {
  '0': f'''{'='*15}- Статусы соединения -{'='*15}
{green}- 200 - Успешно!{white}
{'='*10} HTTP ERROR CODEs: {'='*10}
{red}- 400 - Скрипт не смог обработать URL.
- 401 - Нужна авторизация...надо скачивать ручками.
- 402 - Аналогично 401, доступ после оплаты.
- 403 - Сайт/Браузер/Антивирус запретил вам доступ обращаться по этому URL (возможно дело в VPN).
- 404 - Не найдено, или это устаревшая ссылка.
{white}{'='*10} TIMEOUT ERROR CODEs: {'='*10}
{red}- 522 - Соединение не отвечает (может РКН заблокал). 
- 524 - TCP соеденение провалено. (внутренние ошибки OS).
- 526 - Блокировка сертификата/ом (скорее разное время, или родительский контроль)
{white}{'='*10} ПРОЧЕЕ: {'='*10}
{violet}- 101 - Вы отключены от сети Internet.
- 102 - Ошибка связанная с обработкой URL.{white}''',
  '1': 'Время',
  '2': 'Операционная система',
  '3': 'Версия',
  '4': 'У вас установлена самая актуальная версия скрипта!',
  '5': 'Не удалось получить рабочий каталог.',
  '6':
  'Ваша OS похожа на Colab. Все скачанные файлы будут скачиваться в ваш Google Drive. А точнее в подпапку где сохранен данный файл.',
  '7': 'ПЕРЕЗАПУСТИТЕ СРЕДУ ВЫПОЛНЕНИЯ СКИПТА.',
  '8': 'База не обнаружена!',
  '9': 'У вас установлена устаревшая версия скрипта!',
  '10': 'Установить новую версию?',
  '11': 'Проверка версии не удалась!',
  '12': 'Работающий каталог',
  '13': 'Скачивание в',
  '14': 'Количество изображений',
  '15': 'Вы прервали выполнение кода',
  '16': 'Откадрировать изображения в базе?',
}
