black = "\033[30m"
red = "\033[31m"
green = "\033[32m"
yellow = "\033[33m"
blue = "\033[34m"
violet = "\033[35m"
turquoise = "\033[36m"
white = "\033[37m"
st = "\033[37"

ru_loc = {
     "0": f"""{'='*15}- Статусы подключения -{'='*15}
{green}- 200 - Успех!{white}
{'='*10} КОДЫ ОШИБОК HTTP: {'='*10}
{red}- 400 - Сценарию не удалось проанализировать URL-адрес.
- 401 - Нужна авторизация... нужно скачать вручную.
- 402 - Аналогично 401, доступ после оплаты.
- 403 - Сайт/Браузер/Антивирус отказал вам в доступе к этому URL-адресу (возможно, VPN).
- 404 - Не найдено, или это устаревшая ссылка.
{white}{'='*10} КОДЫ ОШИБОК ТАЙМ-АУТА: {'='*10}
{red}- 522 - Соединение не отвечает (возможно, РКН заблокирован).
- 524 - Ошибка TCP-соединения. (внутренние ошибки ОС).
- 526 - Блокировка сертификата/ом (разные времена, или родительский контроль)
{white} {'='*10} ДРУГОЕ: {'='*10}
{violet}- 101 - Вы отключены от Интернета.
- 102 - Ошибка обработки URL.{white}""",
     "1": 'Время',
     "2": "Операционная система",
     "3": "Версия",
     "4": "У вас установлена последняя версия скрипта!",
     "5": "Не удалось получить рабочий каталог.",
     "6": "Ваша ОС похожа на Colab. Все загруженные файлы будут загружены на ваш Google Диск. Вернее, в подпапку, где этот файл сохранен.",
     "7": "ПЕРЕЗАПУСТИТЕ СРЕДУ ВЫПОЛНЕНИЯ СКИПТА.",
     "8": "База не найдена!",
     "9": "У вас установлена устаревшая версия скрипта!",
     "10": "Установить новую версию?",
     "11": "Проверка версии не удалась!",
     "12": "Рабочий каталог",
     "13": "Загрузить в",
     "14": "Количество изображений",
     "15": "Вы прервали выполнение кода",
     "16": "Обрезать изображения в базе данных?",
     "17": "Каталог",
     "18": "Проверка версии обновления не удалась!",
     "19": "Перезагрузите скрипт.",
     "20": "Текст ниже вызывает уведомление о завершении скрипта.",
     "21": "Скрипт завершен",
     "22": "Готово!",
     "23": "Начать бесконечный цикл выполнения",
     "24": "Скачивание дополнительных данных",
     "25": "Версия главного скрипта",
     "26": "Версия Датабазы",
     "27": "Не найдено",
     "28": "Время выполнения скрипта",
     "29": "Начать скачивание дополнительных данных",
     "30": "У вас установлена устаревшая версия датабазы!",
     "31": "Устаревшая версия ПО",
     "32": "Ранее установленный модуль не был найден.",
     "33": "Нововведения"
}
